// let a, b;

// let span;

// a = prompt("请输a值");

// b = prompt("请输b值");

// a = Number(a);
// b = Number(b);

// alert(`a的值为 ${a},b的值为：${b}`);

// alert(`a+b的值为：${a+b}`);

// span = a;
// a = b;
// b = span;

// alert(`交换后a的值为 ${a},交换后b的值为 ${b}`);

// let arr = ['你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛', '你', '干', '嘛'];



// 外层打印几行
for (let i = 1; i <= 9; i++) {
  //打印每行中的元素
  for (let j = 1; j <= i; j++) {
    document.write(`<div> ${j} x ${i} = ${j * i} </div>`)
  }
  //每行打印完换行
  document.write('<br>')
}


